/*********************************************************					
* StoneEvent.cs					
* 작성자 : YoungJune					
* 작성일 : 2024.05.24 오후 1:46					
**********************************************************/
using Dev_System;
using UnityEngine;					
					
namespace Dev_Events
{					
	public class StoneEvent : MonoBehaviour					
	{					
		//--------------------------------------------------------					
		// 외부 참조 함수 & 프로퍼티					
		//--------------------------------------------------------					
		public void StopBGMEvent()
		{
			Managers.Sound.StopBGM();
		}

		//--------------------------------------------------------					
		// 내부 필드 변수					
		//--------------------------------------------------------					

						
	}//end of class					
}//end of namespace					